In [1]:
import duckdb 
con = duckdb.connect('sakila.duckdb', read_only=True)

In [2]:
Task_1a = """
SELECT 
    title, 
    length
FROM 
    film
WHERE 
    length > 180
ORDER BY 
    length DESC;
"""
# AI Generated Code.
df_long_movies = con.sql(Task_1a).df()
display(df_long_movies)

                 title  length
0         WORST BANGER     185
1        CHICAGO NORTH     185
2       CONTROL ANTHEM     185
3       DARN FORRESTER     185
4    SWEET BROTHERHOOD     185
5          GANGS PRIDE     185
6            HOME PITY     185
7   SOLDIERS EVOLUTION     185
8         POND SEATTLE     185
9        MUSCLE BRIGHT     185
10     MOONWALKER FOOL     184
11      THEORY MERMAID     184
12   CONSPIRACY SPIRIT     184
13    CRYSTAL BREAKING     184
14      SORORITY QUEEN     184
15      SONS INTERVIEW     184
16     SMOOCHY CONTROL     184
17      KING EVOLUTION     184
18      YOUNG LANGUAGE     183
19       SCALAWAG DUCK     183
20      FRONTIER CABIN     183
21       CATCH AMISTAD     183
22           WIFE TURN     183
23       MONSOON CAUSE     182
24       RECORDS ZORRO     182
25          REDS POCUS     182
26         SATURN NAME     182
27      SEARCHERS WAIT     182
28     BAKED CLEOPATRA     182
29       LOVE SUICIDES     181
30      LAWLESS VISION     181
31  RUNAWAY TENENBAUMS     181
32       JACKET FRISCO     181
33      INTRIGUE WORST     181
34     HOTEL HAPPINESS     181
35    HAUNTING PIANIST     181
36      STAR OPERATION     181
37         WILD APOLLO     181
38    ANALYZE HOOSIERS     181

In [3]:
Task_1b = """
SELECT 
    title, 
    rating, 
    length, 
    description
FROM 
    film
WHERE 
    title LIKE '%LOVE%'
ORDER BY 
    title;
"""
df_love_movies = con.sql(Task_1b).df()
display(df_love_movies)

,title,rating,length,description
0,GRAFFITI LOVE,PG,117,A Unbelieveable Epistle of a Sumo Wrestler And...
1,IDAHO LOVE,PG-13,172,A Fast-Paced Drama of a Student And a Crocodil...
2,IDENTITY LOVER,PG-13,119,A Boring Tale of a Composer And a Mad Cow who ...
3,INDIAN LOVE,NC-17,135,A Insightful Saga of a Mad Scientist And a Mad...
4,LAWRENCE LOVE,NC-17,175,A Fanciful Yarn of a Database Administrator An...
5,LOVE SUICIDES,R,181,A Brilliant Panorama of a Hunter And a Explore...
6,LOVELY JINGLE,PG,65,A Fanciful Yarn of a Crocodile And a Forensic ...
7,LOVER TRUMAN,G,75,A Emotional Yarn of a Robot And a Boy who must...
8,LOVERBOY ATTACKS,PG-13,162,A Boring Story of a Car And a Butler who must ...
9,STRANGELOVE DESIRE,NC-17,103,A Awe-Inspiring Panorama of a Lumberjack And a...

In [4]:
task_1c = """
SELECT 
    MIN(length)    AS shortest_movie,
    AVG(length)    AS average_length,
    MEDIAN(length) AS median_length,
    MAX(length)    AS longest_movie
FROM 
    film;
"""

df_stats = con.sql(task_1c).df()
display(df_stats)

   shortest_movie  average_length  median_length  longest_movie
0              46         115.272          114.0            185

In [5]:
task_1d = """
SELECT 
    title, 
    rental_rate,
    rental_duration, 
    (rental_rate / rental_duration) AS cost_per_day
FROM 
    film 
ORDER BY 
    cost_per_day DESC
LIMIT 10;
"""

df_expensive_movies = con.sql(task_1d).df()
display(df_expensive_movies)

                 title  rental_rate  rental_duration  cost_per_day
0      AMERICAN CIRCUS         4.99                3      1.663333
1  BACKLASH UNDEFEATED         4.99                3      1.663333
2      BILKO ANONYMOUS         4.99                3      1.663333
3      BEAST HUNCHBACK         4.99                3      1.663333
4    CARIBBEAN LIBERTY         4.99                3      1.663333
5          AUTUMN CROW         4.99                3      1.663333
6     CASPER DRAGONFLY         4.99                3      1.663333
7       ACE GOLDFINGER         4.99                3      1.663333
8     BEHAVIOR RUNAWAY         4.99                3      1.663333
9    CASUALTIES ENCINO         4.99                3      1.663333

In [6]:
task_1e = """
SELECT 
    a.actor_id,
    a.first_name,
    a.last_name,
    COUNT(fa.film_id) AS number_of_movies
FROM
    actor AS a
    JOIN 
    film_actor AS fa ON a.actor_id = fa.actor_id
GROUP BY
    a.actor_id, 
    a.first_name,
    a.last_name
ORDER BY 
    number_of_movies DESC
    LIMIT 10;
"""
df_top_actors = con.sql(task_1e).df()
display(df_top_actors)

   actor_id first_name  last_name  number_of_movies
0     107.0       GINA  DEGENERES                42
1     102.0     WALTER       TORN                41
2     198.0       MARY     KEITEL                40
3     181.0    MATTHEW     CARREY                39
4      23.0     SANDRA     KILMER                37
5      81.0   SCARLETT      DAMON                36
6      60.0      HENRY      BERRY                35
7     158.0     VIVIEN   BASINGER                35
8      13.0        UMA       WOOD                35
9      37.0        VAL     BOLGER                35

How many movies are there for each rating category?

In [7]:
Task_1_f_1 = """
SELECT 
    rating,
    count(*) AS number_of_movies
FROM    
    film
GROUP BY
    rating
ORDER BY
    number_of_movies DESC;
"""
display(con.sql(Task_1_f_1).df())

  rating  number_of_movies
0  PG-13               223
1  NC-17               210
2      R               195
3     PG               194
4      G               178

Which are the top 5 longest movies suitable for General Audiences (G-rated)?

In [8]:
Task_1_f_2 = """
SELECT
    title,
    length
FROM
    film
WHERE
    rating = 'G'
ORDER BY
    length DESC
LIMIT 5;
"""
display(con.sql(Task_1_f_2).df())

             title  length
0    MUSCLE BRIGHT     185
1   CONTROL ANTHEM     185
2   DARN FORRESTER     185
3  MOONWALKER FOOL     184
4    CATCH AMISTAD     183

How many customers are active (1) vs inactive (0)?

In [9]:
Task_1_f_3 = """
SELECT 
    CASE 
        WHEN active = 1 THEN 'Active'
        ELSE 'Inactive'
    END AS customer_status,
    COUNT(*) AS number_of_customers
FROM 
    customer
GROUP BY 
    active;
"""
display(con.sql(Task_1_f_3).df())

  customer_status  number_of_customers
0          Active                  584
1        Inactive                   15

What is the total replacement cost of our inventory, grouped by film rating?

In [10]:
TASK_1_f_4 = """ 
SELECT
    rating,
    SUM(replacement_cost) AS total_replacement_cost 
FROM
    film
GROUP BY
    rating
    ORDER BY
    total_replacement_cost DESC;
    """
display(con.sql(TASK_1_f_4).df())

  rating  total_replacement_cost
0  PG-13                 4549.77
1  NC-17                 4228.90
2      R                 3945.05
3     PG                 3678.06
4      G                 3582.22